{
    "fields": [
      {
        "id": "name",
        "method": {
          "id": "question",
          "question": "This is a resume. return the person that this resume belongs to, usually found at the top"
        },
        "type": "string"
      },
      {
        "id": "email",
        "method": {
          "id": "question",
          "question": "This is a resume. reutrn the email of the person"
        }
      },
      {
        "id": "phone",
        "method": {
          "id": "question",
          "question": "This is a resume. The phone of the person. Standardize this output to the format [country code]-[area code]-[phone number]"
        }
      },
      {
        "id": "school",
        "method": {
          "id": "list",
          "description": "This is a resume. return the academic information listed on this resume.",
          "properties": [
            {
              "id": "school_item",
              "description": "a single name of the school or university this person attended. if there are multiple schools return a line for each"
            },
            {
              "id": "major",
              "description": "return the major this person studied in undergrad. If no major is listed, return none listed"
            },
            {
              "id": "gpa",
              "description": "return the gpa of the person. If the resume contains more than one, return the most recent. If no gpa is listed, return none listed"
            },
            {
              "id": "graudation_year",
              "description": "return the graduation year of the person. If the resume contains more than one, return the most recent. If no year is listed, return none listed"
            }
          ]
        }
      },
      {
        "id": "companies",
        "method": {
          "id": "list",
          "description": "This is a resume. a list of the companies this person has worked at, what title they held, and a description of their role.",
          "properties": [
            {
              "id": "company_item",
              "description": "a company or organization name"
            },
            {
              "id": "title",
              "description": "a job title or role that the person held at an organization. do not include the name of the organization"
            },
            {
              "id": "date_start",
              "description": "the date that the person started at the role"
            },
            {
              "id": "date_end",
              "description": "the date when the person left this role"
            },
            {
              "id": "role",
              "description": "summarize the description of each position this person has held. do not include the company name or their title. put each description on a seperate line"
            }
          ]
        }
      },
      {
        "id": "skills",
        "method": {
          "id": "list",
          "description": "This is a resume. return a list of skills mentioned in the resume.",
          "properties": [
            {
              "id": "skills",
              "description": "the skills mentioned on the resume, summarized in at most three words. if there are multiple skills, return a line for each"
            }
          ]
        }
      },
      {
        "id": "certifications_and_accolades",
        "method": {
          "id": "list",
          "description": "This is a resume. return a list of non-college certifications and awards mentioned in the resume. Do not list job titles.",
          "properties": [
            {
              "id": "certifications_awards",
              "description": "the certifications or awards listed on the resume. if there are multiple skills, return a line for each"
            }
          ]
        }
      }
    ]
  }